# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
# series has axis labels
my_list = [10,20,30]
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
arr = np.array([10,20,30])
labels = ['a','b','c']
pd.Series(data = arr , index = labels)

a    10
b    20
c    30
dtype: int32

In [5]:
# we can sum up 2 series and the values which ae diff it puts Nan

# Data Frames

In [75]:
# A data frame has series inside it

In [76]:
df = pd.DataFrame(data = np.random.rand(4,4), index = 'A B  C D'.split() , columns = 'X Y Z W'.split())

In [77]:
df

          X         Y         Z         W
A  0.107329  0.635943  0.364994  0.612773
B  0.818159  0.218252  0.115632  0.913586
C  0.010404  0.158906  0.745104  0.046862
D  0.721814  0.676091  0.351146  0.414785

In [78]:
# Selection and indexing in data frames

In [79]:
df['Z']
df[['Y', 'W']]

          Y         W
A  0.635943  0.612773
B  0.218252  0.913586
C  0.158906  0.046862
D  0.676091  0.414785

In [81]:
# Remove a column or row
df.drop('W', axis = 1) # axis is 1 bcz we want the column / to drop a row use axis 0
df.drop(['X' ,'Y'], axis = 1) # to remove 2 or more columns

          Z         W
A  0.364994  0.612773
B  0.115632  0.913586
C  0.745104  0.046862
D  0.351146  0.414785

In [21]:
# Selecting a row
df.loc['A']

X    0.505786
Y    0.096092
Z    0.690723
W    0.802057
Name: A, dtype: float64

In [22]:
# to select with the index
df.iloc[2] # it gives me the C row

X    0.500207
Y    0.496123
Z    0.860025
W    0.741060
Name: C, dtype: float64

In [23]:
# To select a group from the data frame
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.802057  0.096092
B  0.603746  0.679258

In [25]:
# Conditional selecting 
df[df>0.3]

          X         Y         Z         W
A  0.505786       NaN  0.690723  0.802057
B       NaN  0.679258  0.504594  0.603746
C  0.500207  0.496123  0.860025  0.741060
D  0.995702  0.685236       NaN  0.333114

In [27]:
df[df['W']>0.6] # display the data frame where the W column has values greater than 0.6

          X         Y         Z         W
A  0.505786  0.096092  0.690723  0.802057
B  0.181018  0.679258  0.504594  0.603746
C  0.500207  0.496123  0.860025  0.741060

In [28]:
df[df['W']>0.6] ['Y'] # from the new data set get Y column

A    0.096092
B    0.679258
C    0.496123
Name: Y, dtype: float64

In [30]:
df[(df['W']>0.6) & (df['Y'] > 0.5)] # use & not and (cant compare btw 2 series)

          X         Y         Z         W
B  0.181018  0.679258  0.504594  0.603746

In [45]:
# Setting the index
newind = 'CA NY WY OR '.split()
df['States'] = newind
df = df.drop('states', axis = 1) # wrong states was passed

In [46]:
df.set_index('States')

               X         Y         Z         W
States
CA      0.505786  0.096092  0.690723  0.802057
NY      0.181018  0.679258  0.504594  0.603746
WY      0.500207  0.496123  0.860025  0.741060
OR      0.995702  0.685236  0.207838  0.333114

In [48]:
# Adding multiple indexes to Th data frame
# Index Levels

outside = ['G1','G1','G1','G2','G2','G2'] # the outer left  index
inside = [1,2,3,1,2,3]    # the inside index

hier_index = list(zip(outside,inside)) # concatenate the 2 lists int tuples (G1,1)
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [49]:
# the data frame has random values of 6 rows and 2 columns, the index is the multi index above 
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B']) 
df

             A         B
G1 1  0.877077  1.071860
   2  1.049061 -0.966942
   3 -0.036822  0.656736
G2 1 -0.149642  0.715364
   2 -0.591975 -0.224564
   3 -0.935395 -1.295495

In [50]:
# Selecting
df.loc['G1']

          A         B
1  0.877077  1.071860
2  1.049061 -0.966942
3 -0.036822  0.656736

In [51]:
#returns G1 group with the inner index 1 (First row)
df.loc['G1'].loc[1]

A    0.877077
B    1.071860
Name: 1, dtype: float64

In [52]:
#We  can add names to the indexs to spicify what is G1 AND G2 Also what are 1 2 3 
df.index.names = ['Group','Num']

In [53]:
df

                  A         B
Group Num
G1    1    0.877077  1.071860
      2    1.049061 -0.966942
      3   -0.036822  0.656736
G2    1   -0.149642  0.715364
      2   -0.591975 -0.224564
      3   -0.935395 -1.295495

In [54]:
# cross section 
df.xs('G1')

            A         B
Num
1    0.877077  1.071860
2    1.049061 -0.966942
3   -0.036822  0.656736

In [55]:
df.xs(['G1',1]) # to get the 1st row in the cross section

A    0.877077
B    1.071860
Name: (G1, 1), dtype: float64

In [57]:
df.xs(1,level='Num') # to get the inner index 1 from both G1 and G2

              A         B
Group
G1     0.877077  1.071860
G2    -0.149642  0.715364

# Missing Values

In [93]:
# Creating a data frame from a dictionary
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df.isnull() # check if null

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [59]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [60]:
# drop nan values from rows
df.dropna()

     A    B  C
0  1.0  5.0  1

In [61]:
# Drop nan values from columns so use axis 1 (y axis , 0 is for rows (x axis))
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [65]:
# has at least 2 non empty values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [66]:
# Fill in the nan values
df['A'].fillna(value=df['A'].mean()) # A has the element nan in the 2nd row and filled with value = mean of A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [67]:
# Fill in the data frame completly
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

# GroupBy

In [68]:
# Gropby is used to group rows of data together with a function
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [69]:
# group rows based on a acolumn having the funvtion mean or (count , max , min , describe etc...) applied on the rows
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [5]:
df.groupby('Company').max()

NameError: name 'df' is not defined

# Merging , joining Data Frames

In [84]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})  
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [83]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [85]:
# Merging is uses to combine 2 data frames , You can use inner outer left right just like SQL
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [89]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [88]:
pd.merge(left, right, how='outer', on=['key1', 'key2']) # gets everything (like sql) you can use 'inner'

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [90]:
# Joining 
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [95]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [96]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [7]:
df['col2'].unique()   # gets the unique values
df['col2'].nunique()  # number of unique values
df['col2'].value_counts() # counts the occurences

444    2
555    1
666    1
Name: col2, dtype: int64

In [9]:
df['col1'] = df['col1'].apply(lambda x : x * 2)
df

   col1  col2 col3
0     4   444  abc
1     8   555  def
2    12   666  ghi
3    16   444  xyz

# Read files

In [10]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15